import { tpl } from "./chat.tpl";
import "./chat.css";
// import Chat from "../../components/chat-item";
// import Message from "../../components/message-area";

// const chats = [
//   Chat({
//     name: "Андрей",
//     message: "Изображение",
//     time: "10:49",
//     newMessages: 2,
//     logo: "",
//   }),
//   Chat({
//     name: "Киноклуб",
//     message: "Круто!",
//     time: "Понедельник",
//     newMessages: null,
//     logo: "",
//   }),
//   Chat({
//     name: "Илья",
//     message:
//       "Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей! Друзья, у меня для вас особенный выпуск новостей!",
//     time: "15:12",
//     newMessages: 4,
//     logo: "",
//   }),
//   Chat({
//     name: "Вадим",
//     message: "Круто!",
//     time: "Понедельник",
//     newMessages: null,
//     logo: "",
//   }),
//   Chat({
//     name: "Ivan",
//     message: "Hello",
//     time: "15:59",
//     newMessages: 1,
//     logo: "",
//   }),
//   Chat({
//     name: "Ivan",
//     message: "Hello",
//     time: "Вчера",
//     newMessages: null,
//     logo: "",
//   }),
//   Chat({
//     name: "Design Destroyer",
//     message:
//       "В 2008 году художник Jon Rafman начал собирать Rafman начал собирать Rafman начал собирать Rafman начал собирать Rafman начал собирать Rafman начал собирать",
//     time: "15:59",
//     newMessages: 3,
//     logo: "",
//   }),
//   Chat({
//     name: "Ivan",
//     message: "Hello",
//     time: "15:59",
//     newMessages: null,
//     logo: "",
//   }),
//   Chat({
//     name: "Day.",
//     message:
//       "Так увлёкся работой по курсу, что совсем забыл его анонсир Так увлёкся работой по курсу, что совсем забыл его анонсир Так увлёкся работой по курсу, что совсем забыл его анонсир",
//     time: "Понедельник",
//     newMessages: null,
//     logo: "",
//   }),
//   Chat({
//     name: "Стас Рогозин",
//     message:
//       "Можно или сегодня или завтра вечером. Можно или сегодня или завтра вечером. Можно или сегодня или завтра вечером.",
//     time: "12 Апр 2020",
//     newMessages: 5,
//     logo: "",
//   }),
//   Chat({
//     name: "Ivan",
//     message: "Hello",
//     time: "15:59",
//     newMessages: 1,
//     logo: "",
//   }),
//   Chat({
//     name: "Ivan",
//     message: "Hello",
//     time: "Вчера",
//     newMessages: null,
//     logo: "",
//   }),
//   Chat({
//     name: "Design Destroyer",
//     message:
//       "В 2008 году художник Jon Rafman начал собирать Rafman начал собирать Rafman начал собирать Rafman начал собирать Rafman начал собирать Rafman начал собирать",
//     time: "15:59",
//     newMessages: 3,
//     logo: "",
//   }),
//   Chat({
//     name: "Ivan",
//     message: "Hello",
//     time: "15:59",
//     newMessages: null,
//     logo: "",
//   }),
//   Chat({
//     name: "Day.",
//     message:
//       "Так увлёкся работой по курсу, что совсем забыл его анонсир Так увлёкся работой по курсу, что совсем забыл его анонсир Так увлёкся работой по курсу, что совсем забыл его анонсир",
//     time: "1 Мая 2020",
//     newMessages: null,
//     logo: "",
//   }),
//   Chat({
//     name: "Стас Рогозин",
//     message:
//       "Можно или сегодня или завтра вечером. Можно или сегодня или завтра вечером. Можно или сегодня или завтра вечером.",
//     time: "12 Апр 2020",
//     newMessages: 5,
//     logo: "",
//   }),
// ];

// const messages = [
//   Message({
//     text: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
//     time: "15:59",
//   }),
//   Message({ text: "Круто!", time: "15:59", isMe: true }),
//   Message({
//     text: "Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой. Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.",
//     time: "15:59",
//   }),
//   Message({ text: "Круто", time: "15:59", isMe: true }),
// ];

// export default (props) => tpl({ chats, messages, ...props });
